app/controllers/chamados_controller.rb

SELECT "chamados".* FROM "chamados"
---
  def index
    @chamados = Chamado.all

SELECT "chamados".* FROM "chamados" WHERE "chamados"."idsolicitante" = 42 AND "chamados"."tipochamado" IS NULL
SELECT "chamados".* FROM "chamados" WHERE "chamados"."idsolicitante" = 42
SELECT "chamados".* FROM "chamados" WHERE "chamados"."tipochamado" = 2
---
  def busca_usuario
    if params.has_key?("tipo") && params.has_key?("id")
      #Padroniza o tipo recebido
      tipo_padrao = params[:tipo].downcase
      tipo_padrao[0] = tipo_padrao[0].capitalize
      tipo = Chamado::CHAMADO_OPTIONS[tipo_padrao]

      @chamados = Chamado.find_all_by_idsolicitante_and_tipochamado(params[:id],tipo)

    elsif params.has_key?("id")
      @chamados = Chamado.find_all_by_idsolicitante(params[:id])
    elsif params.has_key?("tipo")

      #Padroniza o tipo recebido
      tipo_padrao = params[:tipo].downcase
      tipo_padrao[0] = tipo_padrao[0].capitalize
      tipo = Chamado::CHAMADO_OPTIONS[tipo_padrao]

      @chamados = Chamado.find_all_by_tipochamado(tipo)

SELECT "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "audits".* FROM "audits" WHERE "audits"."idchamado" = 1 LIMIT 1
---
  def show
    @chamado = Chamado.find(params[:id])

    #Traduz o tipo do chamado e seu status para string
    tipo = Chamado::CHAMADO_OPTIONS.invert[@chamado.tipochamado]
    status = Chamado::STATUS_OPTIONS.invert[@chamado.status]

    #Serializa o chamado
    chamado = @chamado.as_json(:except => [:tipochamado, :status])
    dtipo = { :tipochamado => tipo, :status => status }.as_json
    chamado = dtipo.merge(chamado)

    #Encontra o historico do chamado
    @audits = Audit.find_all_by_idchamado(params[:id])

SELECT "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @chamado = Chamado.find(params[:id])

INSERT INTO "chamados" ("created_at", "descricao", "idpedido", "idproduto", "idsolicitante", "status", "tipochamado", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @chamado = Chamado.new(params[:chamado])

    respond_to do |format|
      if @chamado.save

SELECT "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "chamados" SET "idsolicitante" = 41, "updated_at" = '2012-05-02 20:35:58.398313' WHERE "chamados"."id" = 1
INSERT INTO "audits" ("created_at", "idchamado", "mudancas", "tipousuario", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 02 May 2012 20:40:19 UTC +00:00], ["idchamado", 1], ["mudancas", "---\nidsolicitante:\n- 41\n- 40\n"], ["tipousuario", 1], ["updated_at", Wed, 02 May 2012 20:40:19 UTC +00:00]]
---
  def update
    @chamado = Chamado.find(params[:id])

    respond_to do |format|
      if @chamado.update_attributes(params[:chamado])
        #Cria historico
        Audit.create(:idchamado => @chamado.id, :tipousuario => 1, :mudancas => @chamado.tracked_changes)

SELECT "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "chamados" WHERE "chamados"."id" = ?  [["id", 1]]
SELECT "audits".* FROM "audits" WHERE "audits"."idchamado" = 2
---
  def destroy
    @chamado = Chamado.find(params[:id])
    @chamado.destroy

    #Deleta o historico
    @audits = Audit.find_all_by_idchamado(params[:id])